STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/gatt_client_app.c
    procClientContext.current_gatt_proc = GattProcId;

    switch (GattProcId)
    {
      case PROC_GATT_EXCHANGE_CONFIG:
      {
        procClientContext.gatt_error_code = 0;

        LOG_INFO_APP("GATT exchange configuration\n");
        status = aci_gatt_exchange_config(a_ClientContext[index].connHdl);
        if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("Completed Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("Failed, status=0x%02X, result=0x%02X\n\n", bleStatus, procClientContext.gatt_error_code);
        }
      }
      break; /* PROC_GATT_EXCHANGE_CONFIG */
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        procClientContext.gatt_error_code = 0;

        LOG_INFO_APP("GATT services discovery\n");
        bleStatus = aci_gatt_disc_all_primary_services(a_ClientContext[index].connHdl);

        if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES services discovered Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd Failed, status=0x%02X, result=0x%02X\n\n", bleStatus, procClientContext.gatt_error_code);
          status++;
        }
      }
      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_FIND_INCLUDED_SERVICES:
      {
        LOG_INFO_APP("GATT Find Included Services\n");
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].findIncludedServices)
          {
            procClientContext.gatt_error_code = 0;

            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                         a_ClientContext[index].svcInfo[svcIdx].uuid,
                         a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                         a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            bleStatus = aci_gatt_find_included_services(a_ClientContext[index].connHdl,
                                                        a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                                                        a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Service UUID 0x%04X included service found Successfully\n\n",
                           a_ClientContext[index].svcInfo[svcIdx].uuid);
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Service UUID 0x%04X included service found Failed, status =0x%02X, result=0x%02X\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid, bleStatus, procClientContext.gatt_error_code);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_FIND_INCLUDED_SERVICES_0 */

            /* USER CODE END PROC_GATT_FIND_INCLUDED_SERVICES_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_FIND_INCLUDED_SERVICES */

        /* USER CODE END PROC_GATT_FIND_INCLUDED_SERVICES */
        if (status == 0)
        {
          LOG_INFO_APP("Included service discovery ended successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("Included service discovery failed\n\n");
        }
      }
      break; /* PROC_GATT_FIND_INCLUDED_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        LOG_INFO_APP("DISCOVER_ALL_CHARS on ConnHdl=0x%04X\n",a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            procClientContext.gatt_error_code = 0;

            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                              a_ClientContext[index].svcInfo[svcIdx].uuid,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);
            bleStatus = aci_gatt_disc_all_char_of_service(
                              a_ClientContext[index].connHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS && gatt_cmd_resp_wait() == BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Service UUID 0x%04X characteristics discovered Successfully\n\n",
                           a_ClientContext[index].svcInfo[svcIdx].uuid);
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Service UUID 0x%04X characteristics discovery Failed, status=0x%02X, result=0x%02X\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid, bleStatus, procClientContext.gatt_error_code);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS_0 */

            /* USER CODE END PROC_GATT_DISC_ALL_CHARS_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS */

        /* USER CODE END PROC_GATT_DISC_ALL_CHARS */
        if (status == 0)
        {
          LOG_INFO_APP("All characteristics discovered Successfully \n\n");
        }
        else
        {
          LOG_ERROR_APP("All characteristics discovery Failed \n\n");
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        LOG_INFO_APP("DISCOVER_ALL_CHAR_DESCS on ConnHdl=0x%04X\n",
                              a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].charStartHdl != 0x0000
             && a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            procClientContext.gatt_error_code = 0;

