STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/gatt_client_app.c
        LOG_INFO_APP("    UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
          LOG_INFO_APP(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          LOG_INFO_APP(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID)
        {
          LOG_INFO_APP(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */

/* USER CODE END gatt_parse_descs_2 */
        else
        {
          LOG_INFO_APP("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static int gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  int ret = -1;

  LOG_DEBUG_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */

/* USER CODE END gatt_parse_notification_1 */

  return ret;
}

static int gatt_parse_indication(aci_gatt_indication_event_rp0 *p_evt)
{
  int ret = -1;

  LOG_DEBUG_APP("ACI_GATT_CLT_INDICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);

  /* USER CODE BEGIN gatt_parse_indication_1 */

  /* USER CODE END gatt_parse_indication_1 */

  return ret;
}

static void client_discover_task(void)
{
  uint8_t index;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCOVER_SERVICES)
    {
      a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

      /* USER CODE BEGIN client_discover_1 */

      /* USER CODE END client_discover_1 */

      GATT_CLIENT_APP_DiscoverServicesWithIndex(index);

      /* USER CODE BEGIN client_discover_2 */

      /* USER CODE END client_discover_2 */

      /* Check if in the meantime another server has been connected. */
      UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      break;
    }
  }

  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);
  return;
}

static uint8_t gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);
  return procClientContext.gatt_error_code;
}

static uint8_t ReadLongCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t Offset)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  LOG_INFO_APP("Read Long\n");

  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  /* Display Information characteristic */
  ret = aci_gatt_read_long_char_value(connection_handle,
                                      ValueHdl,
                                      Offset);
  if (ret != BLE_STATUS_SUCCESS || (ret = gatt_cmd_resp_wait()) != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gatt_read_long_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X, ret = 0x%02X\n",
                connection_handle,
                ValueHdl,
                ret);
    return ret;
  }

  LOG_INFO_APP("aci_gatt_read_long_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
              connection_handle,
              ValueHdl);

  return procClientContext.gatt_error_code;
}

tBleStatus GATT_CLIENT_APP_ReadCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t *data_length_p, uint8_t **data_p, uint8_t use_read_long)
{
  int index;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  index = GATT_CLIENT_APP_Get_Index(connection_handle);
  if(index < 0)
    return ret;

  /* USER CODE BEGIN GATT_CLIENT_APP_ReadCharacteristic_1 */

  /* USER CODE END GATT_CLIENT_APP_ReadCharacteristic_1 */

  procClientContext.read_char_offset = 0;
  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

  LOG_DEBUG_APP("aci_gatt_read_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
                connection_handle,
                ValueHdl);

  ret = aci_gatt_read_char_value(connection_handle,
                                 ValueHdl);

  if (ret != BLE_STATUS_SUCCESS || (ret = gatt_cmd_resp_wait()) != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gatt_read_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                connection_handle,
                ValueHdl);
    return ret;
  }

  if (use_read_long && procClientContext.read_char_len >= (a_ClientContext[index].att_mtu - 1))
  {
    ret = ReadLongCharacteristic(connection_handle, ValueHdl, procClientContext.read_char_len);
  }

  if(ret != BLE_STATUS_SUCCESS && procClientContext.att_error_code != 0x0B) /* 0x0B: Attribute not long */
  {
    *data_p = NULL;
    *data_length_p = 0;
  }
  else
  {
    *data_p = procClientContext.read_char;
    *data_length_p = procClientContext.read_char_len;
  }

  /* USER CODE BEGIN GATT_CLIENT_APP_ReadCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_ReadCharacteristic_2 */

  return ret;
}

tBleStatus GATT_CLIENT_APP_WriteCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t data_length, uint8_t *data)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_1 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_1 */

  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

  ret = aci_gatt_write_char_value(connection_handle,
                                  ValueHdl,
                                  data_length,
                                  data);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gatt_write_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  connection_handle,
                  ValueHdl);
    return ret;
  }
  else
  {
    LOG_DEBUG_APP("aci_gatt_write_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  connection_handle,
                  ValueHdl);
  }
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();

