STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/gatt_client_app.c
  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_2 */

  return procClientContext.gatt_error_code;
}

/* USER CODE BEGIN LF */
static void COC_CENTRAL_APP_Terminal_Init(void)
{
  RxUART_Init();

  real_time = 1;
  LOG_INFO_APP("Real time mode\n");

  return;
}

static void RxUART_Init(void)
{
  UART_StartRx(COC_Central_APP_Terminal_UART_RxCpltCallback);
}

static void RxUART_ValidProcess(uint8_t data)
{
  if(buffUartRxValidIndex < sizeof(a_buffUartRxValid))
  {
    a_buffUartRxValid[buffUartRxValidIndex++] = data;

    if(data == '\r')
    {
      a_buffUartRxValid[buffUartRxValidIndex-1] = '\0';
      Serial_CMD_Interpreter_CmdExecute( a_buffUartRxValid, buffUartRxValidIndex );
      buffUartRxValidIndex = 0;
    }
  }
  else
  {
    buffUartRxValidIndex = 0;
  }

  return;
}

static void COC_Central_APP_Terminal_UART_RxCpltCallback( uint8_t *pdata, uint16_t size, uint8_t error )
{
  uint8_t byte_received;

  if(size == 1)
  {
    byte_received = pdata[0];

    RxUART_ValidProcess(byte_received);

    if(buffUartRxIndex < sizeof(a_buffUartRx))
    {
      a_buffUartRx[buffUartRxIndex++] = byte_received;
    }
    else
    {
      buffUartRxIndex = 0;
    }

    if( (real_time ==1) || (real_time == 0 && (byte_received == '\n')))
    {
      memcpy(&a_buffCocTx[2], &a_buffUartRx[0], buffUartRxIndex);
      buffCocTxLen = buffUartRxIndex;

      buffUartRxIndex = 0;
      a_buffCocTx[0] = buffCocTxLen;
      a_buffCocTx[1] = 0;

      UTIL_SEQ_SetTask(1 << CFG_TASK_COC_CENTRAL_TX_REQ_ID, CFG_SEQ_PRIO_0);
    }
  }
  else
  {

  }
  UART_StartRx(COC_Central_APP_Terminal_UART_RxCpltCallback);

  return;
 }

static void CentralSendData( void )
{
  tBleStatus status = BLE_STATUS_INVALID_PARAMS;

  /* Data Packet to send to remote */
  status = aci_l2cap_coc_tx_data(BleCoCContextCentral.Channel_Index_List,
                                 2 + buffCocTxLen,/* 2 bytes of header */
                                 (uint8_t *) &a_buffCocTx[0]);

  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> aci_l2cap_coc_tx_data : Fail, reason: 0x%02X\n", status);
  }

  return;
}

/* USER CODE END LF */
